Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/Ingest.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# backup.actions
source: Actions
zh_hans: 操作
zh_hant: 操作

# backup.autoBackup
source: Auto Backup
zh_hans: 自动备份
zh_hant: 自動備份

# backup.createNow
source: Backup Now
zh_hans: 立即备份
zh_hant: 立即備份

# backup.deleteConfirmMessage
source: Are you sure you want to permanently delete this backup? This action cannot be undone.
zh_hans: 您确定要永久删除此备份吗？此操作不可撤销。
zh_hant: 您確定要永久刪除此備份吗？此操作不可復原。

# backup.deleteConfirmTitle
source: Delete Backup
zh_hans: 删除备份
zh_hant: 刪除備份

# backup.exportCurrent
source: Export Current Data
zh_hans: 导出当前数据
zh_hant: 匯出当前資料

source: Backup History
zh_hans: 备份历史
zh_hant: 備份历史

# backup.lastBackup
source: Last Backup
zh_hans: 上次备份
zh_hant: 上次備份

# backup.log.crashRecovery
source: Crash recovery detected — dirty flag found
zh_hans: 检测到崩溃恢复 - 发现脏标记
zh_hant: 检测到崩溃恢複 - 發現脏標記

# backup.log.createFailed
source: Backup failed: %@
zh_hans: 备份失败: %@
zh_hant: 備份失敗: %@

# backup.log.restoreFailed
source: Restore backup failed: %@
zh_hans: 恢复备份失败: %@
zh_hant: 恢複備份失敗: %@

# backup.log.saveIndexFailed
source: Save backup index failed: %@
zh_hans: 保存备份索引失败: %@
zh_hant: 儲存備份索引失敗: %@

# backup.noBackups
source: No Backups
zh_hans: 暂无备份
zh_hant: 暫無備份

# backup.noBackupsDesc
source: Create a backup to protect your knowledge data
zh_hans: 创建备份以保护您的知识库数据
zh_hant: 建立備份以保护您的知識庫資料

# backup.pages
source: pages
zh_hans: 页
zh_hant: 頁

# backup.restore
source: Restore Backup
zh_hans: 恢复备份
zh_hant: 恢複備份

# backup.restoreMessage
source: Are you sure you want to restore from this backup? Current data will be replaced. A safety backup will be created first.
zh_hans: 确定要从此备份恢复吗？当前数据将被替换，恢复前会自动创建安全备份。
zh_hant: 確定要从此備份恢複吗？当前資料將被替換，恢複前會自動建立安全備份。

source: Backup Settings
zh_hans: 备份设置
zh_hant: 備份設定

# backup.title
source: Data Backup
zh_hans: 数据备份
zh_hant: 資料備份

# icloud.aboutSync
source: About iCloud Sync
zh_hans: 关于 iCloud 同步
zh_hant: 關於 iCloud 同步

# icloud.autoSync
source: Auto Sync
zh_hans: 自动同步
zh_hant: 自動同步

# icloud.autoSyncFailed
source: Auto sync failed
zh_hans: 自动同步失败
zh_hant: 自動同步失敗

# icloud.bidirectionalSync
source: Bidirectional Sync
zh_hans: 双向同步
zh_hant: 雙向同步

# icloud.clear
source: Clear iCloud Data
zh_hans: 清除 iCloud 数据
zh_hant: 清除 iCloud 資料

# icloud.clearCloudDataMessage
source: All data in your iCloud private database will be deleted. This cannot be undone.
zh_hans: 您在 iCloud 私有数据库中的所有数据将被清除，此操作无法撤销。
zh_hant: 您在 iCloud 私有資料庫中的所有資料將被清除，此操作無法復原。

# icloud.conflictDetected
source: Conflict Detected
zh_hans: 冲突检测
zh_hant: 衝突检测

# icloud.conflictMessage
source: Local and remote data have conflicts. Please choose a resolution.
zh_hans: 本地与远程数据存在冲突，请选择解决方式。
zh_hant: 本地与遠程資料存在衝突，請選擇解決方式。

# icloud.conflictPolicy
source: Conflict Resolution Policy
zh_hans: 冲突解决策略
zh_hant: 衝突解決策略

# icloud.download
source: Download from iCloud
zh_hans: 从 iCloud 下载
zh_hant: 从 iCloud 下載

# icloud.error.auth
source: Authentication Error
zh_hans: 身份验证错误
zh_hant: 身份驗證錯誤

# icloud.error.cloudKit
source: CloudKit Error
zh_hans: CloudKit 错误
zh_hant: CloudKit 錯誤

# icloud.error.conflict
source: Sync Conflict
zh_hans: 同步冲突
zh_hant: 同步衝突

# icloud.error.conflictResolution
source: Conflict resolution failed
zh_hans: 冲突解决失败
zh_hant: 衝突解決失敗

# icloud.error.decoding
source: Data decoding failed
zh_hans: 数据解码失败
zh_hant: 資料解碼失敗

# icloud.error.encoding
source: Data encoding failed
zh_hans: 数据编码失败
zh_hant: 資料编碼失敗

# icloud.error.network
source: Network Error
zh_hans: 网络错误
zh_hant: 網路錯誤

# icloud.error.notAvailable
source: iCloud unavailable. Please sign in to your iCloud account.
zh_hans: iCloud 不可用，请确认已登录 iCloud 账户
zh_hant: iCloud 不可用，請確認已登錄 iCloud 賬户

# icloud.error.quota
source: iCloud Storage Full
zh_hans: iCloud 存储空间已满
zh_hant: iCloud 存储空間已滿

# icloud.info1
source: Data is stored via iCloud private database
zh_hans: 数据通过 iCloud 私有数据库存储
zh_hant: 資料通過 iCloud 私有資料庫存储

# icloud.info2
source: Sync only between devices with the same Apple ID
zh_hans: 仅限同一 Apple ID 的设备间同步
zh_hant: 仅限同一 Apple ID 的設備間同步

# icloud.info3
source: Defaults to merging data from both sides on conflict
zh_hans: 冲突时默认合并两边数据
zh_hant: 衝突時預設合並兩边資料

# icloud.info4
source: Pages use update time, keeping the newer version
zh_hans: 页面以更新时间为准，保留较新版本
zh_hant: 頁面以更新時間為準，保留較新版本

# icloud.keepLocal
source: Keep Local
zh_hans: 保留本地
zh_hant: 保留本地

# icloud.keepRemote
source: Keep Remote
zh_hans: 保留远程
zh_hant: 保留遠程

# icloud.lastSync
source: Last Sync: %@
zh_hans: 上次同步：%@
zh_hant: 上次同步：%@

# icloud.lastSync.never
source: Never
zh_hans: 从未
zh_hant: 从未

# icloud.merge
source: Merge (Recommended)
zh_hans: 合并（推荐）
zh_hant: 合並（推荐）

# icloud.pull
source: Pull from iCloud
zh_hans: 从 iCloud 拉取
zh_hant: 从 iCloud 拉取

source: iCloud Pull Complete
zh_hans: iCloud 拉取完成
zh_hant: iCloud 拉取完成

# icloud.pullOverwriteMessage
source: All local pages will be replaced by remote data, this action cannot be undone.
zh_hans: 所有本地页面将被远程数据替换，此操作不可撤销。
zh_hant: 所有本地頁面將被遠程資料替換，此操作不可復原。

# icloud.pullWillOverwrite
source: Downloading from iCloud will overwrite local data
zh_hans: 从 iCloud 下载将覆盖本地数据
zh_hant: 从 iCloud 下載將覆蓋本地資料

# icloud.push
source: Push to iCloud
zh_hans: 推送至 iCloud
zh_hant: 推送至 iCloud

source: iCloud Push Complete
zh_hans: iCloud 推送完成
zh_hant: iCloud 推送完成

# icloud.pushToCloud
source: Upload to iCloud
zh_hans: 上传到 iCloud
zh_hant: 上傳到 iCloud

# icloud.status.downloading
source: Downloading...
zh_hans: 下载中...
zh_hant: 下載中...

# icloud.status.error
source: Sync Error
zh_hans: 同步错误
zh_hant: 同步錯誤

# icloud.status.notAvailable
source: iCloud Not Available
zh_hans: iCloud 不可用
zh_hant: iCloud 不可用

# icloud.status.syncing
source: Syncing...
zh_hans: 同步中...
zh_hant: 同步中...

# icloud.status.upToDate
source: Up to Date
zh_hans: 已是最新
zh_hant: 已是最新

# icloud.status.uploading
source: Uploading...
zh_hans: 上传中...
zh_hant: 上傳中...

# icloud.sync
source: Sync with iCloud
zh_hans: 与 iCloud 同步
zh_hant: 与 iCloud 同步

source: iCloud Sync Complete
zh_hans: iCloud 同步完成
zh_hant: iCloud 同步完成

# icloud.syncActions
source: Sync Actions
zh_hans: 同步操作
zh_hant: 同步操作

# icloud.syncSettings
source: Sync Settings
zh_hans: 同步设置
zh_hant: 同步設定

source: iCloud Sync Status
zh_hans: iCloud 同步状态
zh_hant: iCloud 同步狀態

# icloud.title
source: iCloud Sync
zh_hans: iCloud 同步
zh_hant: iCloud 同步

# ingest.actions
source: Source Import
zh_hans: 来源导入
zh_hant: 來源匯入

# ingest.activeTasks
source: %d Running
zh_hans: %d 个任务正在进行
zh_hant: %d 個任務正在進行

# ingest.deepScan
source: Deep Scan (RAG)
zh_hans: 深度扫描 (RAG)
zh_hant: 深度掃描 (RAG)

# ingest.deepScanDesc
source: Full vector search across vault to discover potential links between new and old knowledge.
zh_hans: 对知识库进行全量向量化检索，自动发现新旧知识点之间的潜在关联。
zh_hant: 對知識庫進行全量向量化检索，自動發現新舊知識点之間的潛在關联。

# ingest.ecoIndexingLowPower
source: Low Power Mode Indexing
zh_hans: 🔋 [Eco-Indexing] 系统处于低功耗模式，将采用节流索引策略。
zh_hant: 🔋 [Eco-Indexing] 係統處於低功耗模式，將采用節流索引策略。

# ingest.error
source: Ingest Failed
zh_hans: 导入失败
zh_hant: 匯入失敗

# ingest.error.storageFull
source: Storage is full. Please free up space.
zh_hans: 存储空间不足
zh_hant: 存储空間不足

# ingest.fetchingURL
source: Fetching URL
zh_hans: 正在抓取
zh_hant: 正在抓取

# ingest.field.tags
source: Tags (comma-separated)
zh_hans: 标签 (英文逗号分隔)
zh_hant: 標籤 (英文逗號分隔)

# ingest.field.tagsPlaceholder
source: AI, Knowledge Management, LLM...
zh_hans: AI, 知识管理, LLM...
zh_hant: AI, 知識管理, LLM...

# ingest.field.titlePlaceholder
source: Enter page title...
zh_hans: 输入页面标题...
zh_hant: 輸入頁面標題...

# ingest.fileTooLarge
source: File too large. Maximum: 10MB
zh_hans: 文件过大，最大支持 10MB
zh_hant: 檔案過大，最大支援 10MB

# ingest.hero.subtitle
source: Transform scattered info into structured knowledge
zh_hans: 将零散的信息转化为结构化的知识
zh_hant: 將零散的資訊轉化為結構化的知識

# ingest.iconCustom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# ingest.iconDefault
source: Default
zh_hans: 默认
zh_hant: 預設

# ingest.importFailed
source: Import Failed
zh_hans: 导入失败
zh_hant: 匯入失敗

# ingest.importingFile
source: Importing File
zh_hans: 正在导入文件
zh_hant: 正在匯入檔案

# ingest.invalidURL
source: Invalid URL format
zh_hans: URL 格式无效
zh_hant: URL 格式無效

# ingest.manualEntry
source: Manual Entry
zh_hans: 手动输入
zh_hant: 手動輸入

# ingest.method.file
source: File Drag & Drop
zh_hans: 文件拖拽
zh_hant: 檔案拖拽

# ingest.method.fileDesc
source: Support batch import
zh_hans: 支持多文件批量导入
zh_hant: 支援多檔案批量匯入

# ingest.method.manual
source: Structured Edit
zh_hans: 结构化编辑
zh_hant: 結構化編輯

# ingest.method.manualDesc
source: Support Markdown syntax
zh_hans: 支持 Markdown 语法
zh_hant: 支援 Markdown 語法

# ingest.method.ocr
source: Live Scan
zh_hans: 实时扫描
zh_hant: 實時掃描

# ingest.method.ocrDesc
source: High precision OCR
zh_hans: 高精度文字识别
zh_hant: 高精度文字識別

# ingest.noActivities
source: No recent activities
zh_hans: 近期暂无导入活动
zh_hant: 近期暫無匯入活動

# ingest.preview.truncated
source: [Content truncated, previewing the first 100KB of text only.]
zh_hans: [内容已截断，仅预览前 100KB 文本。]
zh_hant: [內容已截斷，仅預覽前 100KB 文本。]

# ingest.preview.loadMore
source: Load More
zh_hans: 加载更多
zh_hant: 加載更多

# ingest.preview.finished
source: [All content loaded]
zh_hans: [文件已全部加载完毕]
zh_hant: [檔案已全部加載完毕]

# ingest.preview
source: Smart Preview
zh_hans: 智能预览
zh_hant: 智能預覽

# ingest.previewDiscard
source: Discard
zh_hans: 放弃
zh_hant: 放棄

# ingest.recent
source: Recent Activities
zh_hans: 最近导入活动
zh_hant: 最近匯入活動

# ingest.recentActivity
source: View all in Task Center
zh_hans: 在任务中心查看全部
zh_hant: 在任務中心查看全部

# ingest.smartIngest
source: Smart Ingest
zh_hans: 智能入库
zh_hant: 智能入庫

# ingest.smartIngestDesc
source: Automatically extract key info and establish links using AI
zh_hans: 利用 AI 自动提取关键信息并建立链接
zh_hant: 利用 AI 自動提取關鍵資訊並建立链接

# ingest.smartIngestDoneDesc
source: Smart compiled as %@ node
zh_hans: 已智能编译为 %@ 节点
zh_hant: 已智能编譯為 %@ 節点

# ingest.smartToggle
source: Smart Import (LLM)
zh_hans: 智能导入 (LLM)
zh_hant: 智能匯入 (LLM)

# ingest.smartToggleHint
source: Use AI to extract tags, types and optimize content.
zh_hans: 使用 AI 自动提取标签、分类并优化内容格式。
zh_hant: 使用 AI 自動提取標籤、分類並最佳化內容格式。

# ingest.submit
source: Import to Knowledge Base
zh_hans: 导入到知识库
zh_hant: 匯入到知識庫

# ingest.submitting
source: Importing...
zh_hans: 正在导入...
zh_hant: 正在匯入...

# ingest.suggestLinks
source: Suggested Related Pages
zh_hans: 建议关联的页面
zh_hant: 建議關联的頁面

# ingest.tips
source: Import Tips
zh_hans: 导入技巧
zh_hant: 匯入技巧

# ingest.title
source: Knowledge Source
zh_hans: 知识来源
zh_hant: 知識來源

# ingest.urlImport
source: URL Import
zh_hans: 链接导入
zh_hant: 链接匯入

# ingest.urlImportPlaceholder
source: Enter or paste URLs (one per line)
zh_hans: 输入或粘贴网页链接 (每行一个)
zh_hant: 輸入或貼上網頁链接 (每行一個)

# ingest.importRecords
source: Imported Sources
zh_hans: 已导入来源
zh_hant: 已匯入來源

# ingest.importAll
source: All
zh_hans: 全部
zh_hant: 全部

# ingest.noImportRecords
source: No import history yet
zh_hans: 暂无导入记录
zh_hant: 暫無匯入記錄

# ingest.webDesc
source: Supports most web pages, articles, and PDF links. AI will auto-extract core content.
zh_hans: 支持大多数网页、文章和 PDF 链接。AI 将自动提取核心内容。
zh_hant: 支援大多數網頁、文章和 PDF 链接。AI 將自動提取核心內容。

# ocr.addTag
source: Add
zh_hans: 添加
zh_hant: 添加

# ocr.changeIcon
source: Change
zh_hans: 更换
zh_hant: 更換

# ocr.charCountFormat
source: %d characters
zh_hans: %d 字符
zh_hant: %d 字符

# ocr.confirmAndEdit
source: Confirm and Edit
zh_hans: 确认并编辑
zh_hant: 確認並編輯

# ocr.error.cameraUnavailable
source: Camera unavailable
zh_hans: 相机不可用
zh_hant: 相機不可用

# ocr.error.invalidImage
source: Invalid image
zh_hans: 无效图片
zh_hant: 無效圖片

# ocr.error.noResults
source: No text recognized
zh_hans: 未识别到文字
zh_hant: 未識別到文字

# ocr.fromAlbum
source: From Album
zh_hans: 从相册选择
zh_hant: 从相册選擇

# ocr.pageType
source: Page Type
zh_hans: 页面类型
zh_hant: 頁面類型

# ocr.processing
source: Recognizing text...
zh_hans: 正在识别文字...
zh_hant: 正在識別文字...

# ocr.recognize
source: Recognize Text
zh_hans: 识别文字
zh_hant: 識別文字

# ocr.result
source: Recognition Result
zh_hans: 识别结果
zh_hant: 識別結果

# ocr.saveToKnowledge
source: Save to Knowledge
zh_hans: 保存到知识库
zh_hant: 儲存到知識庫

# ocr.scanFailed
source: Text recognition failed
zh_hans: 文字识别失败
zh_hant: 文字識別失敗

# ocr.scanTag
source: scan
zh_hans: 扫描
zh_hant: 掃描

# ocr.selectImage
source: Select an image for text recognition
zh_hans: 选择图片进行文字识别
zh_hant: 選擇圖片進行文字識別

# pdf.add
source: Add PDF
zh_hans: 添加 PDF
zh_hant: 添加 PDF

# pdf.addNote
source: Add note...
zh_hans: 添加备注...
zh_hant: 添加備注...

# pdf.annotateSelected
source: Annotate selected text
zh_hans: 标注选中文字
zh_hant: 標注選中文字

# pdf.cannotLoadPDF
source: Cannot load PDF
zh_hans: 无法加载 PDF
zh_hant: 無法加載 PDF

# pdf.contentPreview
source: Content Preview
zh_hans: 内容预览
zh_hant: 內容預覽

# pdf.createdPage
source: Created page: %@
zh_hans: 已创建页面：%@
zh_hant: 已建立頁面：%@

# pdf.extractionMethod
source: Extraction Method
zh_hans: 提取方式
zh_hant: 提取方式

# pdf.extractionRange
source: Extraction Range
zh_hans: 提取范围
zh_hant: 提取範圍

# pdf.fromPage
source: From page
zh_hans: 从第
zh_hant: 从第

# pdf.fullText
source: Full Text
zh_hans: 全文
zh_hant: 全文

# pdf.highlightCountFormat
source: %d highlights
zh_hans: %d 个高亮
zh_hant: %d 個高亮

# pdf.highlightsOnly
source: Highlights Only
zh_hans: 仅标注内容
zh_hant: 仅標注內容

# pdf.ingestModeFormat
source: Ingest mode: %@
zh_hans: 导入模式：%@
zh_hant: 匯入模式：%@

source: PDF Library
zh_hans: PDF 文档库
zh_hant: PDF 文档庫

# pdf.libraryHint
source: Add PDF documents, read and highlight, extract content to knowledge base
zh_hans: 添加 PDF 文档，阅读并高亮标注，提取内容到知识库
zh_hant: 添加 PDF 文档，閱讀並高亮標注，提取內容到知識庫

# pdf.noHighlights
source: No highlights yet. Add highlights while reading first.
zh_hans: 暂无标注内容，请先在阅读时添加高亮标注
zh_hant: 暫無標注內容，請先在閱讀時添加高亮標注

source: PDF Not Supported
zh_hans: 不支持 PDF 文件
zh_hant: 不支援 PDF 檔案

# pdf.notSupportedDesc
source: This platform or layout does not support displaying PDF content directly.
zh_hans: 当前平台或布局不支持直接展示 PDF 内容。
zh_hant: 当前平臺或布局不支援直接展示 PDF 內容。

# pdf.noteLabel
source: Note:
zh_hans: 备注：
zh_hant: 備注：

# pdf.page
source: page
zh_hans: 页
zh_hant: 頁

# pdf.pageNumber
source: Page %d
zh_hans: 第 %d 页
zh_hant: 第 %d 頁

# pdf.pageRange
source: Page Range
zh_hans: 指定页范围
zh_hant: 指定頁範圍

# pdf.pageSeparator
source: \n\n--- Page %@ ---\n\n
zh_hans: \n\n--- 第 %@ 页 ---\n\n
zh_hant: \n\n--- 第 %@ 頁 ---\n\n

# pdf.saveAnnotation
source: Save Annotation
zh_hans: 保存标注
zh_hant: 儲存標注

# pdf.targetPage
source: Target Page
zh_hans: 目标页面
zh_hant: 目標頁面

# pdf.title
source: PDF Documents
zh_hans: PDF 文档
zh_hant: PDF 文档

# pdf.toPage
source: to page
zh_hans: 页到第
zh_hant: 頁到第

# schema.field.content
source: Content
zh_hans: 内容
zh_hant: 內容

# schema.field.icon
source: Icon
zh_hans: 图标
zh_hant: 圖示

# conflict.manualMerge
source: Manual Merge
zh_hans: 手动合并
zh_hant: 手動合並

# conflict.finishMerge
source: Finish Merge
zh_hans: 完成合并
zh_hant: 完成合並

# conflict.noContentConflict
source: No content conflicts detected.
zh_hans: 未检测到内容冲突。
zh_hant: 未检测到內容衝突。

# conflict.autoResolveDesc
source: Automatically merge non-conflicting changes and resolve simple conflicts with smart defaults.
zh_hans: 自动合并非冲突变更，并以智能默认策略解决简单冲突。
zh_hant: 自動合並非衝突變更，並以智能預設策略解決简單衝突。

# conflict.doAutoResolve
source: Auto Resolve
zh_hans: 自动解决
zh_hant: 自動解決

# conflict.listTitle
source: Conflicts
zh_hans: 冲突列表
zh_hant: 衝突清單

# conflict.localTime
source: Local Time
zh_hans: 本地时间
zh_hant: 本地時間

# conflict.cloudTime
source: Cloud Time
zh_hans: 云端时间
zh_hant: 雲端時間

# conflict.smartOverrideMode
source: Smart Override Mode
zh_hans: 智能覆盖模式
zh_hant: 智能覆蓋模式

# conflict.keepLocalAll
source: Keep All Local
zh_hans: 全部采用本地
zh_hant: 全部采用本地

# conflict.keepCloudAll
source: Keep All Cloud
zh_hans: 全部采用云端
zh_hant: 全部采用雲端

# conflict.localVersionTag
source: Local Version
zh_hans: 本地版本
zh_hant: 本地版本

# conflict.cloudVersionTag
source: Cloud Version
zh_hans: 云端版本
zh_hant: 雲端版本

# conflict.editorTag
source: Editor
zh_hans: 编辑器
zh_hant: 編輯器

# conflict.takeLocalAction
source: Take Local Version
zh_hans: 采用本地版本
zh_hant: 采用本地版本

# conflict.takeCloudAction
source: Take Cloud Version
zh_hans: 采用云端版本
zh_hant: 采用雲端版本

# conflict.noTimeInfo
source: No time info
zh_hans: 无时间信息
zh_hant: 無時間資訊

# ingest.status.starting
source: Starting parsing...
zh_hans: 开始智能解析...
zh_hant: 開始智能解析...

# ingest.status.aiEnriching
source: AI enriching semantics...
zh_hans: AI 正在理解与增强语义...
zh_hant: AI 正在理解与增強語义...

# ingest.status.generatingSummary
source: Generating summary...
zh_hans: 提炼全局结构化摘要中...
zh_hant: 提炼全局結構化摘要中...

# ingest.status.chunking
source: Structured Chunking
zh_hans: 结构化分块
zh_hant: 結構化分塊

# ingest.status.processingChunk
source: Processing chunk...
zh_hans: 处理段落分块...
zh_hant: 處理段落分塊...

# ingest.status.vectorizing
source: Computing vector embeddings...
zh_hans: 计算并存储向量嵌入索引 (Vector Indexing)...
zh_hant: 计算並存储向量嵌入索引 (Vector Indexing)...

# ingest.status.completed
source: Completed
zh_hans: 知识处理与沉淀完成
zh_hant: 知識處理与沉淀完成

# ingest.status.webscraper.level1_success
source: Level 1 extraction succeeded
zh_hans: Level 1: Jina 高级解析成功
zh_hant: Level 1: Jina 進階解析成功

# ingest.status.webscraper.level1_failed
source: Level 1 extraction failed
zh_hans: Level 1 失败，正在降级使用原生直连...
zh_hant: Level 1 失敗，正在降级使用原生直連...

# ingest.status.webscraper.level2_success
source: Level 2 extraction succeeded
zh_hans: Level 2: Googlebot 伪装抓取成功
zh_hant: Level 2: Googlebot 偽装抓取成功

# ingest.status.webscraper.level2_failed
source: Level 2 extraction failed
zh_hans: Level 2 失败或遇到限制，正在寻找历史快照...
zh_hant: Level 2 失敗或遇到限制，正在尋找历史快照...

# ingest.status.webscraper.level3_success
source: Level 3 extraction succeeded
zh_hans: Level 3: 成功从网页存档提取数据
zh_hant: Level 3: 成功从網頁存档提取資料

# ingest.status.webscraper.level3_failed
source: Level 3 extraction failed
zh_hans: Level 3 失败，正在使用深度 DOM 提取器作为最终方案...
zh_hant: Level 3 失敗，正在使用深度 DOM 提取器作為最終方案...

# ingest.status.webscraper.level4_success
source: Level 4 extraction succeeded
zh_hans: Level 4: 本地深度解析兜底成功
zh_hant: Level 4: 本地深度解析兜底成功

# ingest.status.webscraper.paywall_detected
source: Paywall detected
zh_hans: 检测到付费墙或访问限制 (HTTP %d)，正在绕过...
zh_hant: 检测到付費牆或访問限制 (HTTP %d)，正在绕過...

# ingest.status.extraction
source: Document Extraction
zh_hans: 文档解析
zh_hant: 文档解析

# ingest.status.enhancement
source: AI Semantic Enhancement
zh_hans: AI语义增强
zh_hant: AI語义增強

# ingest.status.embedding
source: Vectorization
zh_hans: 向量化入库
zh_hant: 向量化入庫

# error.internalError
source: Internal Error
zh_hans: 内部错误
zh_hant: 內部錯誤

# error.notReady
source: Not Ready
zh_hans: 未就绪
zh_hant: 未就緒

# misc.delete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# error.busy
source: Busy
zh_hans: 繁忙
zh_hant: 繁忙

# ingest.viewRawText
source: View Raw Text
zh_hans: 查看原始文本
zh_hant: 查看原始文本

# ingest.openLink
source: Open Original Link
zh_hans: 打开原始链接
zh_hant: 打開原始链接

# ingest.previewFile
source: Preview Original File
zh_hans: 预览原始文件
zh_hant: 預覽原始檔案

# ingest.rawContentTitle
source: Raw Content
zh_hans: 原始内容
zh_hant: 原始內容

# ingest.viewPage
source: View Page
zh_hans: 查看页面
zh_hant: 查看頁面

# ingest.openWith
source: Open With
zh_hans: 打开文件
zh_hant: 打開檔案

# ingest.duplicateFile
source: "%@" already imported, skipping duplicate
zh_hans: 「%@」已导入，跳过重复文件
zh_hant: 「%@」已匯入，跳過重複檔案

# ingest.imageTooLarge
source: Image too large. Maximum: 5MB
zh_hans: 图片过大，最大支持 5MB
zh_hant: 圖片過大，最大支援 5MB

# ingest.voiceTooLong
source: Recording too long. Maximum: 15 minutes
zh_hans: 录音过长，最长支持 15 分钟
zh_hant: 錄音過長，最長支援 15 分鐘

# ingest.importCooldown
source: Please wait before importing again
zh_hans: 请稍后再导入
zh_hant: 請稍後再匯入

# ingest.batchURLTitle
source: Batch Import URLs
zh_hans: 批量导入 URL
zh_hant: 批量匯入 URL

# ingest.batchURLPlaceholder
source: Paste URLs, one per line (max 10)
zh_hans: 粘贴 URL，每行一个（最多 10 个）
zh_hant: 貼上 URL，每行一個（最多 10 個）

# ingest.batchImport
source: Batch Import
zh_hans: 批量导入
zh_hant: 批量匯入

# ingest.invalidURLAtLine_%@
source: Invalid URL at line %@
zh_hans: 第 %@ 行 URL 格式不正确
zh_hant: 第 %@ 行 URL 格式不正確

# ingest.validURLCount_%@_%@
source: Valid: %@ · Max: %@
zh_hans: 有效: %@ 个 · 最多 %@ 个
zh_hant: 有效: %@ 個 · 最多 %@ 個

# ingest.importProgress
source: Importing (%@/%@)
zh_hans: 导入中 (%@/%@)
zh_hant: 匯入中 (%@/%@)

# ingest.batchResult
source: %d succeeded, %d failed
zh_hans: %d 个成功，%d 个失败
zh_hant: %d 個成功，%d 個失敗

# ingest.aiTag
source: AI Tag & Classify
zh_hans: AI 标签与分类
zh_hant: AI 標籤与分類

# ingest.aiTagging
source: Analyzing...
zh_hans: 分析中...
zh_hant: 分析中...

# ingest.untagged
source: Untagged
zh_hans: 未分类
zh_hant: 未分類

# ingest.aiTagSuccess
source: Tags updated
zh_hans: 标签已更新
zh_hant: 標籤已更新

# ingest.aiTagFailed
source: AI analysis failed
zh_hans: AI 分析失败
zh_hant: AI 分析失敗

# ingest.aiTagPrompt
source: Analyze the following web content. Extract: 1) Alias title (3-15 chars) 2) Category tags (1-3, comma-separated). Content: %@ Return JSON: {"aliasTitle": "...", "tags": ["tag1", "tag2"]}
zh_hans: 请分析以下网页内容，提取：1) 别名标题（3-15字）2) 分类标签（1-3个，逗号分隔）。 内容： %@ 请以 JSON 格式返回：{"aliasTitle": "...", "tags": ["标签1", "标签2"]}
zh_hant: 請分析以下網頁內容，提取：1) 別名標題（3-15字）2) 分類標籤（1-3個，逗號分隔）。 內容： %@ 請以 JSON 格式返回：{"aliasTitle": "...", "tags": ["標籤1", "標籤2"]}

# ingest.imageExtracting
source: Extracting images...
zh_hans: 提取图片中...
zh_hant: 提取圖片中...

# ingest.imageOCRLabel
source: [Image OCR]
zh_hans: [图片 OCR]
zh_hant: [圖片 OCR]

# ingest.imageCount
source: %d image(s) extracted
zh_hans: 已提取 %d 张图片
zh_hant: 已提取 %d 張圖片

# ingest.imageSkippedTooLarge
source: Image skipped: too large
zh_hans: 图片已跳过: 过大
zh_hant: 圖片已跳過: 過大

# ingest.imageSkippedFailed
source: Image skipped: download failed
zh_hans: 图片已跳过: 下载失败
zh_hant: 圖片已跳過: 下載失敗

# ingest.file
source: File Import
zh_hans: 文件导入
zh_hant: 檔案匯入

# ingest.manual
source: Manual Input
zh_hans: 手动录入
zh_hant: 手動錄入

# ingest.url
source: URL Extract
zh_hans: 网页链接
zh_hant: 網頁链接

# ingest.ocr
source: OCR Scan
zh_hans: 文字识别
zh_hant: 文字識別

# ingest.clipboard
source: Clipboard
zh_hans: 剪贴板导入
zh_hant: 剪貼板匯入

# ingest.voice
source: Voice Note
zh_hans: 语音便签
zh_hant: 語音便簽

# ingest.sourcePrefix
source: Source:
zh_hans: 来源：
zh_hant: 來源：

# ingest.urlSourcePrefix
source: Source Link:
zh_hans: 来源链接：
zh_hant: 來源链接：

# ingest.scrapeTimePrefix
source: Scraped At:
zh_hans: 抓取时间：
zh_hant: 抓取時間：

# pdf.sourceURL
source: Source Link
zh_hans: 来源链接
zh_hant: 來源链接

# ingest.audioSubtitle
source: Voice Memo Content
zh_hans: 音频速记内容
zh_hant: 音頻速記內容

# ocr.previewTitle
source: Recognized Image Preview
zh_hans: 识别预览图
zh_hant: 識別預覽圖

# ingest.resultTitle
source: Extracted Lineage
zh_hans: 提取关系溯源
zh_hant: 提取關係溯源

# ingest.previewConfirm
source: Confirm
zh_hans: 确认应用
zh_hant: 確認套用

# pdf.pageCountFormat
source: %d pages
zh_hans: %d 页
zh_hant: %d 頁

# ingest.clipboardImport
source: Clipboard Import
zh_hans: 剪贴板导入
zh_hant: 剪貼板匯入

# ingest.ocrScan
source: OCR Scan
zh_hans: OCR 扫描
zh_hant: OCR 掃描

# pdf.ingestToKnowledge
source: Ingest to Knowledge
zh_hans: 导入到知识库
zh_hant: 匯入到知識庫

# ingest.voiceNote
source: Voice Note
zh_hans: 语音笔记
zh_hant: 語音筆記
